package test07_탐색;

public class Array04_2차원배열_팔방탐색_탐색끝까지 {
    public static void main(String[] args) {
        
        // 다음 배열에서 1이 들어있는 칸을 포함한 행과 열에 
        // 모두 2를 채워 넣는다.(1이 들어있는 칸 제외)
        
        int[][] arr = {
                {0, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 0, 0, 1, 0},
                {0, 0, 0, 0, 0, 0, 0}
        };
        
        int N = 7;
        
       
        
        
        
    }
}
